mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32L0xx_DFP</name>
  <description>STMicroelectronics STM32L0 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.0.1" date="2019-03-05">
      Device support:
      - Added STM32L010 devices.
      - Updated STM32L0 HAL to V1.10.0
      - Updated documentation.
      - updated Flash Option assembler file.
      CMSIS-Driver:
      - USB Device:
      -- Updated USBD_EndpointConfigure function to check that maximum packet size requested fits into configured FIFO (compile time configured).
      - USB Device: Corrected transmitted count for non-control IN endpoints
      - USART: Corrected UARTx/USARTx related typing mistakes
      Corrected: launching STM32CubeMX via "play" button for existing projects overwrites with a new STM32CubeMX project file instead of loading it.
      MX_Device_h.ftl:
      - Updated parsing of USART virtual mode
      - Updated generation of macros: Added handling for '(' and ')' symbols
    </release>
    <release version="2.0.0" date="2018-01-18">
      This DFP works either with STM32CubeMX (STM32CubeMX V4.23.0 and STM32Cube_FW_L0 V1.10.0 or higher)
      or Standalone (no support for STM32CubeMX). STM32CubeMX is mandatory for use of CMSIS-Driver and MDK-Middleware.
      - New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' from the STM32Cube MX bundle for configuration of pins and clocks via STM32CubeMX.
      This pack only contains a subset of the files from STM32Cube_FW_L0 version 1.10.0  (ST Drivers, STM32Cube documentation and fonts).
      Updated documentation for STM32Cube Framework usage.
      Device support:
      - Updated device names to match STM32CubeMX notation.
      - Updated core option MPU/NO_MPU.
      - Added DBGMCU INI files configuring debug settings of the target for debug units without support for debug sequences.
      - Updated SVD files.
      - Updated documentation.
      CMSIS Driver:
      - Added I2C driver.
      - Added SPI driver.
      - Added UART/USART/IrDA/SmartCard driver.
      - Added USB Device driver.
      Board support:
      - Added STM32L073Z-EVAL.
      - Updated Board Support LED driver for STM32L053-Discovery.
      Example projects:
      - Added USB Device HID and MassStorage on STM32L073Z-EVAL Board.
    </release>
    <release version="1.6.1" date="2017-09-27">
      Added devices STM32L041E6, STM32L082CZY.
      Corrected system_stm32l0xx.c (function SystemCoreClockUpdate() ).
    </release>
    <release version="1.6.0" date="2016-06-06">
      Aligned devices with STM32CubeMx v4.15.0.
      Updated device support files to STM32Cube Firmware Library (V 1.6.0).
      Corrected system_stm32l0xx.c.
    </release>
    <release version="1.5.0" date="2016-04-04">
      Aligned devices with list of STM32Cube Firmware Library (V 1.5.0).
      Corrected RAM1 according data sheets
      Updated documentation
      Updated SVD files fixing name of Bit9 of PWR Peripheral CR Register
    </release>
    <release version="1.4.0" date="2015-11-11">
      Added subfamilies STM32L011/21, STM32L031/41, STM32L071/72/73, STM32L081/82/83.
      Added Option Byte (OPT), EEPROM Flash Algorithm.
      Updated STM32L0xx device support files.
      Updated user manuals, datasheets.
      Updated RTX Blinky examples.
    </release>
    <release version="1.3.0" date="2015-02-23">
      Added Board Support for STM32L053-Discovery board.
    </release>
    <release version="1.2.0" date="2014-11-18">
      Reworked STM32L0xx Flash Programming Algorithm to improve programming speed.
    </release>
    <release version="1.1.0" date="2014-09-30">
      Added devices STM32L051T6, STM32L051T8, STM32L052T6, STM32L052T8.
      Added SVD files.
      Updated documentation.
      Removed ST-Link Add-On installer from PACK
    </release>
    <release version="1.0.0">
      First Release version of STM32L0 Device Family Pack.
    </release>
  </releases>

  <devices>
    <family Dfamily="STM32L0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dendian="Little-endian"/>

      <book name="Documentation/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <description>
The STM32L0 devices provides high power efficiency for a wide range of performance. It is achieved with a large choice of internal and external clock sources, an internal voltage adaptation and several low-power modes.
Typical applications include application control and user interfaces, handheld equipment, A/V receivers and digital TV, PC peripherals, gaming and GPS platforms, industrial applications, PLCs, inverters, printers, scanners, alarm systems, video intercoms, and HVACs

  - CRC calculation unit, 96-bit unique ID
  - USB 2.0 crystal-less, battery charging detection and LPM
  - True RNG and firewall protection
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            Sequence("CheckID");
          </block>
        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021034, Read32(0x40021034) | 0x00400000);                   // Set RCC_APB2ENR.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB1_Fz);                                    // DBGMCU_APB1_FZ: Configure APB1 Peripheral Freeze Behavior
            Write32(0x4001580C, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

