mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>
      </sequences>

      <feature type="Other"         n="1"                           name="20-byte backup register"/>
      <feature type="RNG"           n="1"                           name="True Random Number Generator"/>
      <feature type="Other"         n="1"/>
      <feature type="DMA"           n="7"/>
      <feature type="Timer"         n="5"       m="16"/>
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="USART"         n="3"       m="4000000"/>
      <feature type="I2C"           n="2"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="1.65"    m="3.60"/>

      <!-- ************************  Subfamily 'STM32L010'  **************************** -->
      <subFamily DsubFamily="STM32L010">
        <processor Dclock="32000000" Dmpu="NO_MPU"/>
        <debug svd="CMSIS/SVD/STM32L0x0.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x0.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00443854.pdf" title="STM32L0x0 Reference Manual"/>

        <!-- *************************  Device 'STM32L010C6'  ***************************** -->
        <device Dname="STM32L010C6Tx">
          <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L010x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L010x6_8_EEPROM.FLM" start="0x08080000" size="0x00000100" default="0"/>

          <feature type="QFP" n="48"/>

          <book name="Documentation/DM00440567.pdf" title="STM32L010C6 Data Sheet"/>
        </device>

        <!-- *************************  Device 'STM32L010F4'  ***************************** -->
        <device Dname="STM32L010F4Px">
          <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L010x4"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L010x4_EEPROM.FLM" start="0x08080000" size="0x00000080" default="0"/>

          <feature type="SOP" n="20"/>

          <book name="Documentation/DM00440565.pdf" title="STM32L010F4 STM32L010K4 Data Sheet"/>
        </device>

        <!-- *************************  Device 'STM32L010K4'  ***************************** -->
        <device Dname="STM32L010K4Tx">
          <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L010x4"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L010x4_EEPROM.FLM" start="0x08080000" size="0x00000080" default="0"/>

          <feature type="QFP" n="32"/>

          <book name="Documentation/DM00440565.pdf" title="STM32L010F4 STM32L010K4 Data Sheet"/>
        </device>

        <!-- *************************  Device 'STM32L010K8'  ***************************** -->
        <device Dname="STM32L010K8Tx">
          <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L010x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L010x6_8_EEPROM.FLM" start="0x08080000" size="0x00000100" default="0"/>

          <feature type="QFP" n="32"/>

          <book name="Documentation/DM00440569.pdf" title="STM32L010K8 STM32L010R8 Data Sheet"/>
        </device>

        <!-- *************************  Device 'STM32L010R8'  ***************************** -->
        <device Dname="STM32L010R8Tx">
          <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L010x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L010x6_8_EEPROM.FLM" start="0x08080000" size="0x00000100" default="0"/>

          <feature type="QFP" n="64"/>

