mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
      <!-- ************************  Subfamily 'STM32L081'  **************************** -->
      <subFamily DsubFamily="STM32L081">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L081xx"/>
        <debug svd="CMSIS/SVD/STM32L0x1.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108281.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documentation/DM00162467.pdf" title="STM32L081xx Data Sheet"/>

        <!-- *************************  Device 'STM32L081CZ'  ***************************** -->
        <device Dname="STM32L081CZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L081CZTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L081KZ'  ***************************** -->
        <device Dname="STM32L081KZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L081KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L081KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L082'  **************************** -->
      <subFamily DsubFamily="STM32L082">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L082xx"/>
        <debug svd="CMSIS/SVD/STM32L07x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"        start="0x1FF80000" size="0x00000014" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM"   start="0x08080000" size="0x00001800" default="0"/>

        <book name="Documentation/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>
        <book name="Documentation/DM00141132.pdf" title="STM32L082xx Data Sheet"/>

        <!-- *************************  Device 'STM32L082KB'  ***************************** -->
        <device Dname="STM32L082KB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>

          <variant Dvariant="STM32L082KBTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L082KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L082KZ'  ***************************** -->
        <device Dname="STM32L082KZ">
          <memory id="IROM1"                              start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM" start="0x08000000" size="0x00030000"             default="1"/>

          <variant Dvariant="STM32L082KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L082KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L082CZ'  ***************************** -->
        <device Dname="STM32L082CZ">
          <memory id="IROM1"                              start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM" start="0x08000000" size="0x00030000"             default="1"/>

          <variant Dvariant="STM32L082CZYx"> <feature type="CSP" n="49"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L083'  **************************** -->
      <subFamily DsubFamily="STM32L083">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L083xx"/>
        <debug svd="CMSIS/SVD/STM32L07x.svd"/>

