mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
          <variant Dvariant="STM32L083VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L083VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L0">
      <description>STMicroelectronics STM32L0 Series Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32L0*"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L010x4">
      <description>STMicroelectronics STM32L010x4 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L010?4*"/>
    </condition>
    <condition id="STM32L010x6">
      <description>STMicroelectronics STM32L010x6 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L010?6*"/>
    </condition>
    <condition id="STM32L010x8">
      <description>STMicroelectronics STM32L010x8 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L010?8*"/>
    </condition>
    <condition id="STM32L010xB">
      <description>STMicroelectronics STM32L010xB Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L010?B*"/>
    </condition>
    <condition id="STM32L011">
      <description>STMicroelectronics STM32L011 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L011*"/>
    </condition>
    <condition id="STM32L021">
      <description>STMicroelectronics STM32L021 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L021*"/>
    </condition>
    <condition id="STM32L031">
      <description>STMicroelectronics STM32L031 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L031*"/>
    </condition>
    <condition id="STM32L041">
      <description>STMicroelectronics STM32L041 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L041*"/>
    </condition>
    <condition id="STM32L051">
      <description>STMicroelectronics STM32L051 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L051*"/>
    </condition>
    <condition id="STM32L052">
      <description>STMicroelectronics STM32L052 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L052*"/>
    </condition>
    <condition id="STM32L053">
      <description>STMicroelectronics STM32L053 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L053*"/>
    </condition>
    <!--condition id="STM32L061">
      <description>STMicroelectronics STM32L061 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L061*"/>
    </condition-->
    <condition id="STM32L062">
      <description>STMicroelectronics STM32L062 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L062*"/>
    </condition>
    <condition id="STM32L063">
      <description>STMicroelectronics STM32L063 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L063*"/>
    </condition>
    <condition id="STM32L071">
      <description>STMicroelectronics STM32L071 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L071*"/>
    </condition>
    <condition id="STM32L072">
      <description>STMicroelectronics STM32L072 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L072*"/>
    </condition>
    <condition id="STM32L073">
      <description>STMicroelectronics STM32L073 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L073*"/>
    </condition>
    <condition id="STM32L081">
      <description>STMicroelectronics STM32L081 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L081*"/>
    </condition>
    <condition id="STM32L082">
      <description>STMicroelectronics STM32L082 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L082*"/>
    </condition>
    <condition id="STM32L083">
      <description>STMicroelectronics STM32L083 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L083*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L0 CMSIS">
      <description>STMicroelectronics STM32L0 Devices and CMSIS-Core</description>
      <require condition="STM32L0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>


        <!-- Device + Compiler Conditions -->
    <condition id="STM32L0 ARMCC">
      <description>STMicroelectronics STM32L011 Devices and ARMCC Compiler</description>
      <require condition="STM32L0"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32L010x4 ARMCC">
      <description>STMicroelectronics STM32L010x4 Devices and ARMCC Compiler</description>
      <require condition="STM32L010x4"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L010x6 ARMCC">
      <description>STMicroelectronics STM32L010x6 Devices and ARMCC Compiler</description>
      <require condition="STM32L010x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L010x8 ARMCC">
      <description>STMicroelectronics STM32L010x8 Devices and ARMCC Compiler</description>
      <require condition="STM32L010x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L010xB ARMCC">
      <description>STMicroelectronics STM32L010xB Devices and ARMCC Compiler</description>
      <require condition="STM32L010xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32L011 ARMCC">
      <description>STMicroelectronics STM32L011 Devices and ARMCC Compiler</description>
      <require condition="STM32L011"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L021 ARMCC">
      <description>STMicroelectronics STM32L021 Devices and ARMCC Compiler</description>
      <require condition="STM32L021"/>
      <require condition="Compiler ARMCC"/>
    </condition>
