mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
    <condition id="STM32L031 ARMCC">
      <description>STMicroelectronics STM32L031 Devices and ARMCC Compiler</description>
      <require condition="STM32L031"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L041 ARMCC">
      <description>STMicroelectronics STM32L041 Devices and ARMCC Compiler</description>
      <require condition="STM32L041"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L051 ARMCC">
      <description>STMicroelectronics STM32L051 Devices and ARMCC Compiler</description>
      <require condition="STM32L051"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L052 ARMCC">
      <description>STMicroelectronics STM32L052 Devices and ARMCC Compiler</description>
      <require condition="STM32L052"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L053 ARMCC">
      <description>STMicroelectronics STM32L053 Devices and ARMCC Compiler</description>
      <require condition="STM32L053"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <!--condition id="STM32L061 ARMCC">
      <description>STMicroelectronics STM32L061 Devices and ARMCC Compiler</description>
      <require condition="STM32L061"/>
      <require condition="Compiler ARMCC"/>
    </condition-->
    <condition id="STM32L062 ARMCC">
      <description>STMicroelectronics STM32L062 Devices and ARMCC Compiler</description>
      <require condition="STM32L062"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L063 ARMCC">
      <description>STMicroelectronics STM32L063 Devices and ARMCC Compiler</description>
      <require condition="STM32L063"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L071 ARMCC">
      <description>STMicroelectronics STM32L071 Devices and ARMCC Compiler</description>
      <require condition="STM32L071"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L072 ARMCC">
      <description>STMicroelectronics STM32L072 Devices and ARMCC Compiler</description>
      <require condition="STM32L072"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L073 ARMCC">
      <description>STMicroelectronics STM32L073 Devices and ARMCC Compiler</description>
      <require condition="STM32L073"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L081 ARMCC">
      <description>STMicroelectronics STM32L081 Devices and ARMCC Compiler</description>
      <require condition="STM32L081"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L082 ARMCC">
      <description>STMicroelectronics STM32L082 Devices and ARMCC Compiler</description>
      <require condition="STM32L082"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L083 ARMCC">
      <description>STMicroelectronics STM32L083 Devices and ARMCC Compiler</description>
      <require condition="STM32L083"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMX Conditions -->
    <condition id="STM32L0 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L011 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32L053 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L053 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L053"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L073 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L073 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L073"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32L0 STARTUP CORTEX GPIO PWR RCC FLASH">
      <description>STMicroelectronics STM32L0 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
    <condition id="STM32L0 HAL">
      <description>STMicroelectronics STM32L0 devices and HAL </description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32L0 HAL DMA">
      <description>STMicroelectronics STM32L0 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32L0 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L0 LL">
      <description>STMicroelectronics STM32L0 devices and LL </description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32L0 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32L0 Device and LL</description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>
