mdhardenburgh/Blinky/Packages/.cache/Keil.STM32L0xx_DFP.2.0.1.pdsc
      <component Cgroup="STM32Cube HAL" Csub="UART"      Cversion="1.10.0" condition="STM32L0 HAL DMA">
        <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_UART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_uart.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_uart_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="USART"     Cversion="1.10.0" condition="STM32L0 HAL DMA">
        <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="WWDG"      Cversion="1.10.0" condition="STM32L0 HAL">
        <description>Window watchdog (WWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_WWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_wwdg.c"/>
        </files>
      </component>

      <!-- STM32L0xx LL Drivers -->
      <component Cgroup="STM32Cube LL" Csub="COMMON"     Cversion="1.10.0" condition="STM32L0 STARTUP LL UTILS RCC PWR">
        <description>Common LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DRIVERS_USED
          #define RTE_DEVICE_LL_COMMON
        </RTE_Components_h>
        <files>
          <file category="include" name="Drivers/STM32L0xx_HAL_Driver/Inc/"/>
          <file category="include" name="Drivers/STM32L0xx_HAL_Driver/Inc/Legacy/"/>
          <file category="source"  name="MDK/Driver/stm32l0xx_ll.c"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32_assert.h"       attr="template" select="STM32 assert template"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32l0xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source"  name="MDK/Templates_LL/Src/stm32l0xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header"  name="MDK/Templates_LL/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source"  name="MDK/Templates_LL/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="ADC"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Analog-to-digital converter (ADC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_adc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="COMP"       Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Analog Comparator (COMP) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_comp.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="CRC"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>CRC calculation unit (CRC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_crc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="CRS"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Clock recovery system (CRS) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_CRS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_crs.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DAC"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Digital-to-analog converter (DAC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_dac.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DMA"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>DMA controller (DMA) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="EXTI"       Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Extended interrupts and events controler (EXTI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_EXTI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_exti.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="GPIO"       Cversion="1.10.0"  condition="STM32L0 LL">
        <description>General-purpose I/O (GPIO) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_gpio.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="I2C"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Inter-integrated circuit (I2C) interface LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_i2c.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="LPTIM"      Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Low Power Timer (LPTIM) interface LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_LPTIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lptim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="LPUART"     Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Universal asynchronous receiver transmitter (LPUART) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_LPUART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lpuart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="PWR"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Power controller (PWR) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RCC"        Cversion="1.10.0"  condition="STM32L0 LL">
        <description>Reset and clock control (RCC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rcc.c"/>
        </files>
      </component>
